[
  {
    "title": "AUTHENTICATION MEGATHREAD 🚩",
    "username": "arozze",
    "comments": [
      {
        "commenter_username": "Conley521",
        "comment": "https://preview.redd.it/jrmtc8rwhu6g1.jpeg?width=3299&amp;format=pjpg&amp;auto=webp&amp;s=d49d6d645860eb41774349cc0ccb8ddcd20763f6\n\nReal or Fake?"
      },
      {
        "commenter_username": "javignoz",
        "comment": "Buying an onyx compression from Vinted\n\nHello, I really wanna get an onyx but I heard they will be no more drops until a long time so I searched on vinted since am in Europe and found a lot of fakes ( read a bit on the bands and visionary logo and the intern pattern that shouldn’t be black and kept away all the scalpers and the fake photoshops scalpers ) so I searched only from real persons who sold theirs in unique piece but am still wondering if this is real or not any thoughts he says that he can also send a authenticity receipt\n\nhttps://preview.redd.it/iippw092pv6g1.jpeg?width=1179&amp;format=pjpg&amp;auto=webp&amp;s=4158f35242a6f12b8a14b64b70221a7452f2a65b"
      },
      {
        "commenter_username": "DragonMatricks",
        "comment": "https://preview.redd.it/yo6z4jn3508g1.jpeg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=e2d7eb6ced729a4eb70211a2d789ed4d8a756c0b\n\nReal or fake?"
      },
      {
        "commenter_username": "iamthebigguy0",
        "comment": "Can you guys please help me figure out if this Onyx v1 is real or not?\n\nhttps://preview.redd.it/q3pamy2ald8g1.jpeg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=e9dea06aa8dd27cb11a5e87551d104e80df09f95"
      },
      {
        "commenter_username": "[deleted]",
        "comment": "[deleted]"
      },
      {
        "commenter_username": "Dangerous-Victory958",
        "comment": "https://preview.redd.it/y4ok4inz879g1.jpeg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=2046efa985d04f28cdc255d2efcca647ebdf2357\n\nreal or fake"
      },
      {
        "commenter_username": "HugeHope7430",
        "comment": "https://preview.redd.it/ivnk3xwtko9g1.jpeg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=9c42e5ddf6763cd8375b0c3400b3984b29c9d3e3\n\nNot bought it yet it’s from a second hand seller with no tag and i can’t tell if it’s real or not I did ask chat gpt and they said it was real but just want to double check"
      },
      {
        "commenter_username": "Particular-Exam-734",
        "comment": "Is This Real. MORE PICS IN REPLIES!\n\nhttps://preview.redd.it/8nk4hi0x0gbg1.jpeg?width=1201&amp;format=pjpg&amp;auto=webp&amp;s=922003c12197bf9d3d74493044b8daa1ffe2ca32"
      },
      {
        "commenter_username": "nemo2257",
        "comment": "https://preview.redd.it/rct1r1u2gsbg1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=8d17940cdf764696ba064c5a6ef8dcc71898ce67\n\nReal or fake ? Onyx V4"
      }
    ]
  },
  {
    "title": "BUY | TRADE | SELL Megathread",
    "username": "V0dka-Coke",
    "comments": [
      {
        "commenter_username": "[deleted]",
        "comment": "[deleted]"
      },
      {
        "commenter_username": "lgvrn_03",
        "comment": "Buying: Anything except the Black with blue logo in Southeast Asia"
      },
      {
        "commenter_username": "papa_papa6-9",
        "comment": "Looking to trade longsleeve and short sleeve blue size small for medium any color"
      },
      {
        "commenter_username": "raccoonwhispers",
        "comment": "Selling 4 different Onyx v5. I hate how they fit me. The new blue colorway short sleeve size S, green colorway short sleeve size S, grey colorway long sleeve size S, OG blue and black short sleeve size XS. Not going to sell them at insane scalping prices. All are 100% authentic.\n\nEDIT: willing to trade for YLA stuff like Superman. Just DM me. If trading, I will be picky."
      },
      {
        "commenter_username": "asdvfisosbdjsk",
        "comment": "https://preview.redd.it/eq32a3chowzf1.jpeg?width=1692&amp;format=pjpg&amp;auto=webp&amp;s=ae1ecc8a217ec7f823e6c87f27dd6fc51c1c9eb7\n\nWant to buy these retro track pants in size L/XL or even XXL."
      },
      {
        "commenter_username": "ARaphh",
        "comment": "Onyx V1 Yellow tank (uploading tommorow) Form V2 White, Black logo (uploading tommorow) Form V2 grey ,white logo (uploading tommorow) Red Avant shirt 2016 (uploading tommorow) Devant seamless Blue tank Devant seamless Grey Long sleeve Devant seamless grey shirt Onyx V3 Grey Tank Onyx V3 Grey Shirt Onyx V3 Black Shirt (Small) Onyx V3 Black Shirt (Medium) Have 2, keeping one Phantom seamless Grey Shirt Phantom seamless Red Tank Performance seamless black long sleeve Grey Pioneer Hoodie Blue Pioneer Hoodie\n\nOnyx V1 Shirt yellow and Onyx v1 Hoodie Blue colorway aswell However i dont know if im dead set on selling these yet for aesthetic purposes\n\n✅ @rap-64214 ✅all items are legit photos provided in listings and happy to provide more. Selling the lot for personal reasons, happy to negotiate"
      },
      {
        "commenter_username": "swoliboli17",
        "comment": "‼️‼️‼️Looking for grey devant long sleeve size M-L willing to trade or pay"
      },
      {
        "commenter_username": "Forliww",
        "comment": "Trading the blue onyx long sleeve size M for any short sleeve in size M"
      },
      {
        "commenter_username": "inrusswetrust12",
        "comment": "FOR SALE:\n\n1x Gymshark Onyx 5.0 Tank - Black/Onyx Grey - size small\n\n1x Gymshark Onyx 5.0 Seamless Long Sleeve T-Shirt - Black/Onyx Grey - size small\n\nBought two sizes each, don’t need the smalls. Planning on returning to Gymshark, still in bag, US only. Can provide screenshots of order emails from Gymshark/pictures etc.\n\nPlease DM, I’m flexible on price as long as I don’t lose money packing/shipping it to you."
      },
      {
        "commenter_username": "13557126",
        "comment": "Selling\nOnyx Brand Blue/black short sleeve XXL\nOnyx lift green/black short sleeve XXL"
      },
      {
        "commenter_username": "Hour_Introduction338",
        "comment": "If anyone has the red/black t shirt in XXL that they want to sell, hmu. I have the unworn, red tank in that size for any trade interest as well (for the red t shirt)."
      },
      {
        "commenter_username": "Potential_Gate6761",
        "comment": "FOR SALE OR TRADE\n\nMedium Short Sleeve Black/Grey Onyx v5. Unworn and still in original package. Dm me. from PH only."
      },
      {
        "commenter_username": "Short_Quit5853",
        "comment": "Selling: Red Onyx Short Sleeve in Small"
      },
      {
        "commenter_username": "rambovaz",
        "comment": "Selling onyx v5 red medium short sleeves and white small long sleeves"
      },
      {
        "commenter_username": "LeBj_",
        "comment": "Looking for any size S onyx short sleeve and long sleeve to buy. DM me"
      },
      {
        "commenter_username": "stillerceltix",
        "comment": "Looking to buy Green Short Sleeve LARGE"
      },
      {
        "commenter_username": "AsianguySan",
        "comment": "Looking to trade my M black long sleeve for L black, brand blue or green. Or short sleeve M green"
      },
      {
        "commenter_username": "phantomdrive",
        "comment": "Looking to trade black long sleeve medium for large long sleeve."
      },
      {
        "commenter_username": "Maleficent-Theme2332",
        "comment": "Selling SMALL Grey Short Sleeve - Ships out same day with quick shipping ✅dm to buy"
      },
      {
        "commenter_username": "Ruskeet",
        "comment": "Selling XL Onyx v5 Sleeveless Grey/Black Tank Top Shirt still new with tags in bag."
      },
      {
        "commenter_username": "Ruskeet",
        "comment": "Looking to trade or sell gently used XL Grey/Black v5 Onyx T Shirt for large of the same"
      },
      {
        "commenter_username": "asdvfisosbdjsk",
        "comment": "Pioneer hoodie M - Grey/Grey , XL Grey/Grey &amp; Black/Grey"
      },
      {
        "commenter_username": "tfsi2014",
        "comment": "Selling/swap onyx 5.0 L for XL or selling for retail. UK based."
      }
    ]
  },
  {
    "title": "New GS fit. Love this color",
    "username": "ObjectivePay5165",
    "comments": [
      {
        "commenter_username": "LegDrive91",
        "comment": "Looks great on you"
      }
    ]
  },
  {
    "title": "Gymshark Vs. Youngla",
    "username": "Single-Lawfulness-49",
    "comments": [
      {
        "commenter_username": "SladeWilsonXL9",
        "comment": "Gymshark. It’s a workout brand, YoungLA started as a workout brand but now it’s a cringe streetwear brand that caters heavily to Gen Z trends, although Gymshark is kind of starting to do that too"
      },
      {
        "commenter_username": "Geeeniefied",
        "comment": "Gymshark, imo youngla is kinda juvenile with designs and athletes. I laughed when I first saw their stuff, what does youngla even mean, young, loud, autistic?"
      },
      {
        "commenter_username": "Konkra101",
        "comment": "In terms of quality youngla, in terms of design usually gymshark"
      },
      {
        "commenter_username": "FuriousFeld",
        "comment": "Gymshark, because of David laid lol"
      },
      {
        "commenter_username": "Maidenlessunicorn",
        "comment": "I shop YLA for their oversized pants/joggers. All my other gym clothing is mostly Gymshark. I guess they are both great but depends on what you get. \n\nI'm not the biggest fan of street wear style pieces so I lean towards GS."
      },
      {
        "commenter_username": "JayTyn1",
        "comment": "I started with GS and started rotating YLA in. YLA for casual wear and GS for the gym. Sometimes I wear both (e.g., GS joggers with YLA baggy shirt). As far as superiority, both can be good and both can be trash. GS has very thin “oversized” shirts and YLA has very short “oversized” tops with some giving crop top vibes."
      },
      {
        "commenter_username": "SexyProcrastinator",
        "comment": "YoungLA is higher quality… their compressions are second bar to none. \n\nStringers too."
      },
      {
        "commenter_username": "Jolzo",
        "comment": "you ask this in the gymshark subreddit  \nwhat do you think the answer will be"
      },
      {
        "commenter_username": "Burnhalo",
        "comment": "Just depends how I'm feeling tbh, both have things I like. I tend to prefer my gymshark bottoms, and for as much as I love my onyx, the warrior X compression from young la is my absolute favorite compression right now."
      },
      {
        "commenter_username": "Ok-Aardvark-9938",
        "comment": "How about cheap normal non branded clothing. I’m there to put in work not for social points"
      },
      {
        "commenter_username": "StaarvinMarvin",
        "comment": "They’re both worn by grifters lmao"
      },
      {
        "commenter_username": "Gullible-Customer426",
        "comment": "It might be time for a new brand to take the throne"
      },
      {
        "commenter_username": "Roxi_X_Rose",
        "comment": "Personally Gymshark! I have several GS pieces that are 5 years old and still in great condition.\n\nI do prefer YLA bras and joggers (I buy the men’s joggers) but for women GS shorts are amazing. Thicker, squat proof, not see through. \n\nYLA quality seems to be better for men versus women. I personally find a lot of their designs cringy af. I also look at them as more of a lifestyle/street brand and with them opening brick and mortar stores, I’m sure that’s going to be more of the direction they go in."
      },
      {
        "commenter_username": "SandwichCultural6942",
        "comment": "If you want workout clothes, gymshark, I mean YoungLA looks kinda cool but the clothes aren’t for working out, they’re too heavy and in summer it’s just impossible to wear them"
      }
    ]
  },
  {
    "title": "Sizing Wide Leg Joggers",
    "username": "321girlwannahavefun",
    "comments": []
  },
  {
    "title": "See through leggings",
    "username": "Ecstatic_Piccolo5824",
    "comments": [
      {
        "commenter_username": "Lucky7sss",
        "comment": "Companies are using cheaper and cheaper materials these days, cheaper costs more profits. Most sport apparel companies all did this over time."
      },
      {
        "commenter_username": "Healthy-Sort-5533",
        "comment": "Not to mention the pricing going up is well"
      },
      {
        "commenter_username": "Lord_Gaara",
        "comment": "https://preview.redd.it/l6pw9641mndg1.png?width=484&amp;format=png&amp;auto=webp&amp;s=cd8828e3bb738106d17bd56719a5f35824fb67ea\n\nsorry for the zoom creep shot but it aint underwear, it's the design"
      },
      {
        "commenter_username": "LILEVILANG3L",
        "comment": "Crazy thing is that it’s not even a light blue color which would be even worse"
      },
      {
        "commenter_username": "ApprehensiveScene878",
        "comment": "Dude! Shut up! 🤫 &lt;—— guys at the gym"
      },
      {
        "commenter_username": "invisible-totheworld",
        "comment": "Hey y’all… I went on the website to look this up myself and what OP is pointing out is NOT the clothes that are see through it’s the literal material design that goes around the glutes…"
      },
      {
        "commenter_username": "willpeeforcoins",
        "comment": "That’s not her underwear thats the design foo. Get it together."
      },
      {
        "commenter_username": "Driver_no_1",
        "comment": "It's just thin material, cheaper and pretty much mainstream now. Even mens clothing is getting thinner too. You can still wear underwear underneath, most do!"
      },
      {
        "commenter_username": "GiraffeLeft8781",
        "comment": "I think its just the contouring. I bought the shorts (will be returning) but i personally didnt think you could see my underwear."
      },
      {
        "commenter_username": "PurpleImmediate5010",
        "comment": "The best kind my friend"
      },
      {
        "commenter_username": "alexgravis",
        "comment": "I’ve always bought leggings for my wife and Gymshark was our favorite brand. They fitted her well, the sizes were good and the price was fair. We tried Lululemon, but sizing was a little bit inconsistent and way overpriced. This year I bought some Alphalete and Gymshark during the Black Friday sale and Gymshark was so disappointing. Black Leggings. The single most basic and important Item was completely see through. It was final sale so I haven’t returned it. Alphalete was the opposite. Great first impression. Gymshark needs to get their shit together."
      },
      {
        "commenter_username": "withtheheavies",
        "comment": "Intentional"
      },
      {
        "commenter_username": "TwoToOblivion",
        "comment": "I thought this was an ad at first and was thinking “why would you advertise that your leggings are see through”"
      },
      {
        "commenter_username": "Choupi_jg",
        "comment": "I bought this legging this week in maroon and its not the underwear but the legging design"
      },
      {
        "commenter_username": "Used_Dimension6503",
        "comment": "Lifehack: if you dont wear underwear, nobody can see it through.\n\nSo funny all the girls at the beach wearing bikinis, but hey lets totally freak out because someone who stares at my super tight outfit can see that i wear something under it omg 🤯"
      }
    ]
  },
  {
    "title": "Alternative to the Apex 7” Hybrid?",
    "username": "Gohan-92",
    "comments": [
      {
        "commenter_username": "ngoal",
        "comment": "These are fantastic shorts... Revealing in the crotch but crazy comfy"
      },
      {
        "commenter_username": "Original_Student_395",
        "comment": "Pursue Fit or Dfyne"
      }
    ]
  },
  {
    "title": "Fit Pic! Compression/Slim Fit",
    "username": "Maidenlessunicorn",
    "comments": [
      {
        "commenter_username": "KeyboardWalkerCat",
        "comment": "I think the Vital Seamless is a good first Gymshark piece. It’s slim fit so its waist area is actually more forgiving than muscle and compression fits but still tight at the top. It has a decent stretchy and textured material so it gives off that premiumness for me. It, also, gives you an idea how you’ll fit in the others. For context, I have an S Onyx(muscle fit) and it still fits tighter than my XS Vital which still has lots of room at the waist. I might try an M Element Baselayer(compression) soon."
      },
      {
        "commenter_username": "Z3n1k3",
        "comment": "Is that compression or vital seamless? If it's the latter I love mine, I rock it when I don't wanna rock my onyx 😂"
      }
    ]
  },
  {
    "title": "Anyone know the brand??",
    "username": "MajesticImpress6429",
    "comments": [
      {
        "commenter_username": "JayTyn1",
        "comment": "Gymshark pumper joggers. I have a pair, they are oversized and comfortable."
      },
      {
        "commenter_username": "Mysticwashere",
        "comment": "They're gymshark pumper pants."
      },
      {
        "commenter_username": "Z3n1k3",
        "comment": "Welcome to pumper pants 😎 they're Hella comfy. I have petrol blue, black, and camo Grey of these."
      }
    ]
  },
  {
    "title": "Water bottle quality",
    "username": "Skersikal-Sherykler",
    "comments": [
      {
        "commenter_username": "voyeristic_reader",
        "comment": "Happened to me. Really poor quality. Very flimsy"
      },
      {
        "commenter_username": "MiserableBritGirl",
        "comment": "Email them and they’ll replace it, I’ve found their CS pretty good (in the UK at least)"
      },
      {
        "commenter_username": "ZainEternity",
        "comment": "You just too strong mate wtf you mean it broke TWISTING the cap on 🤣🤣🤣"
      },
      {
        "commenter_username": "SandwichCultural6942",
        "comment": "Reach the support team, they’ll make it up to you 😉 once I wore a brand new tshirt and it had a little hole and gave me a gift card because the tshirt was out of stock, but yeah, that bottle is horribly weak, two friends of mine had them and both of them got broken 🫠🫠🫠"
      },
      {
        "commenter_username": "Temporary_Platypus62",
        "comment": "They’ll just replace it\nI had visible dark stains and asked them and they sent me a new one without taking the old one !"
      },
      {
        "commenter_username": "Outrageous-Song5799",
        "comment": "So many of their product are shit tbf lol we should have a list of « do not buy »"
      },
      {
        "commenter_username": "PI3Kachu_Proteomics",
        "comment": "You guys realise that they just buy the same drink bottles as the Kmart ones, but slap a gym shark logo on it and bump the price up.. right?"
      },
      {
        "commenter_username": "ConsciousStudent8505",
        "comment": "Those bottles are shit quality. Happened to mine within a month as well 😬"
      },
      {
        "commenter_username": "bibila",
        "comment": "I dropped it once and done…"
      },
      {
        "commenter_username": "RedDayV1",
        "comment": "same here man girlfriend dropped hers 1 foot and shattered"
      },
      {
        "commenter_username": "Realistic_Chef_2321",
        "comment": "This isnt just with these gymshark bottles, its the general problem with this style in general, I got one off amazon, same design, I twisted the cap on a bit too hard and it broke"
      },
      {
        "commenter_username": "Sundae-Soggy",
        "comment": "all the gs waterbottles are mediocre at best"
      },
      {
        "commenter_username": "WiJoWi",
        "comment": "You guys still drink out of plastic??"
      }
    ]
  },
  {
    "title": "Fit like Arrival 5\" shorts but no logo?",
    "username": "Icy-Tie-1862",
    "comments": [
      {
        "commenter_username": "sean18_",
        "comment": "Mier men’s shorts on amazon; super cheap and good quality"
      }
    ]
  },
  {
    "title": "GS fit hits every time",
    "username": "KyrieLuvsLife",
    "comments": [
      {
        "commenter_username": "Full-Contribution314",
        "comment": "I even match it with my nails 💅 👌"
      }
    ]
  },
  {
    "title": "longsleeve worthy?",
    "username": "Thundderpec",
    "comments": [
      {
        "commenter_username": "No-Nobody3393",
        "comment": "What shirt is that it’s fire"
      },
      {
        "commenter_username": "Tommyto8",
        "comment": "Dang bro, from this photo I can tell you have a solid physique, but this shirt is definitely nerfing it 🥀"
      }
    ]
  },
  {
    "title": "Power washed T-shirt",
    "username": "UseInteresting1926",
    "comments": [
      {
        "commenter_username": "Z3n1k3",
        "comment": "First of all, I love the intro lol. \n\n\nI do have a tank version of this that I love to use on pull days and is my fave. It's definitely a fake acid washed look up close and the gymshark in the back is subtle but to me I like the design."
      },
      {
        "commenter_username": "BULLETok",
        "comment": "I personally love mine because of the fit and the softness. Quality wises it's a tad better than the standard power but wish they  continue the line with a wash navy."
      },
      {
        "commenter_username": "AMadRam",
        "comment": "I have this shirt and it's far superior to the standard power range in comfort and softness. It's also slightly baggier on the sleeves which is what I like. \n\nShame they have run out of stock on these and the colours are crap (except the black ones)"
      },
      {
        "commenter_username": "Necessary_Squash1988",
        "comment": "10/10 my favourite ovs tee"
      },
      {
        "commenter_username": "UseInteresting1926",
        "comment": "Sweet, thanks for the replies y’all!"
      },
      {
        "commenter_username": "l3nn0n0",
        "comment": "They sent me the one in the pic by mistake and when I told them they told me to keep it. It is my favorite shirt right now, feels heavy, super nice quality. You will love it!"
      }
    ]
  },
  {
    "title": "What size am I?",
    "username": "Objective-Ad-2643",
    "comments": [
      {
        "commenter_username": "AMadRam",
        "comment": "You (or we) cannot say based on any of this.\n\nGymshark has a sizing guide to measure up bras, tops and bottoms. Please use that."
      },
      {
        "commenter_username": "therealmfmars",
        "comment": "I am usally a size M in gym clothes bras and leggings and shorts however in gym shark I’m large in bras shorts and legging besides their graphic t if there men shirts I get small if it’s women’s I get medium or large depends I would get a large the quality is great however the return process thru them is terrible always get refunded never return for a size up or down I went through hell trying to get my money back or the clothes in a larger size"
      },
      {
        "commenter_username": "MiserableBritGirl",
        "comment": "A small with Gymshark is like a 8-10 women’s size if that helps - UK sizes"
      }
    ]
  },
  {
    "title": "Didn't receive order and CS doesn't want to help",
    "username": "E_Szczesny",
    "comments": []
  },
  {
    "title": "Does anyone know if David Laid was at the fit expo this year?",
    "username": "SuppaSkilZ",
    "comments": []
  },
  {
    "title": "Peek A Boo Sports Bra 🙈",
    "username": "KyrieLuvsLife",
    "comments": [
      {
        "commenter_username": "LILEVILANG3L",
        "comment": "This is the most comfortable GS sports bra for me! \n\nI also find it fits a bit more relaxed than other GS Bras which is nice for non cardio days."
      },
      {
        "commenter_username": "ZainEternity",
        "comment": "These but for men ❤️‍🔥❤️‍🔥❤️‍🔥"
      },
      {
        "commenter_username": "Adept-Ad-3163",
        "comment": "Girl you’re such a baddie omg"
      },
      {
        "commenter_username": "[deleted]",
        "comment": "Wow! You wear it very well."
      },
      {
        "commenter_username": "Sad_Philosophy_9629",
        "comment": "You wear it well."
      },
      {
        "commenter_username": "Successful-Dot-6819",
        "comment": "👌🏾🤤"
      },
      {
        "commenter_username": "[deleted]",
        "comment": "The color suits you"
      },
      {
        "commenter_username": "Rickyrusso",
        "comment": "Wow 🥰🥰🥰😍😍"
      }
    ]
  },
  {
    "title": "Shadow seamless (ghost restock??)",
    "username": "Affectionate_Bass101",
    "comments": [
      {
        "commenter_username": "Bieb",
        "comment": "Isn’t the main complaint about these that the fit is very off?"
      }
    ]
  },
  {
    "title": "Confused with sizing of men gymshark tops",
    "username": "Live-Atmosphere-6538",
    "comments": [
      {
        "commenter_username": "AMadRam",
        "comment": "To answer your own question (which you have answered in your own post, might I add) - \n\nThere would be some variation in sizes but for the most part you should find a size that you are comfortable in. For example, GS has a lot of oversize fits that fit me in S but I can guarantee you that I wont' fit in a muscle fit/slim fit S and would have to size up on it."
      }
    ]
  },
  {
    "title": "Energy Seamless cropped leggings still look good!",
    "username": "Yukio_Petite",
    "comments": [
      {
        "commenter_username": "Charming_Dot1108",
        "comment": "omg throwback! weren't these released in 2016 lol"
      }
    ]
  },
  {
    "title": "Why are restocking items at Gymshark so impossible?",
    "username": "Danibook1",
    "comments": [
      {
        "commenter_username": "gymshark",
        "comment": "We're sorry to hear this! If you head to www.support.gymshark.com and drop us a message with the store you're shopping on, our support team will be able to check if the items are restocking on your store. You can reach out through the chatbox at the bottom right of the page."
      },
      {
        "commenter_username": "Shanavret",
        "comment": "Sometimes I have to literally babysit the website when there’s something I want if I didn’t get it at launch. It’s such a pain. I wish they just stocked and restocked more."
      },
      {
        "commenter_username": "problemchild227",
        "comment": "Do they announce lines are being discontinued? The Vital Seamless seems to be all discontinued and the Shadow Seamless too."
      }
    ]
  },
  {
    "title": "Where else can I buy a genuine Onyx V5?",
    "username": "Outrageous-Clue-5428",
    "comments": [
      {
        "commenter_username": "NeonAerow",
        "comment": "Vinted or eBay are probably your best bets. Fakes have gotten good but there are still 3 details the fakes get wrong:\n\n\n1. EDIT: Most real Onyx’s don’t have inner collar loop / tag but some have. Ones that don’t are probably real but ones that have it you should be extra careful with but could be real. \n\n\n2. The spacing of the “be a visionary” text at the bottom is way to tight / not enough spacing between the words.\n\n3. Colors of in particular the inner shirt look way too bright / not dark enough. Especially for the Black/Light Grey colorway this very easy too spot. Even though the colourway is called light grey is should actually be darker than you expect. \n\nHope this helps! Also just ask the seller for a purchase receipt / order confirmation."
      },
      {
        "commenter_username": "WiJoWi",
        "comment": "Why not just get fakes? Ngl most of my Nikes are fake and they're fuckin awesome. Last just as long and cost 60$ instead of 220"
      },
      {
        "commenter_username": "Super-Green-140",
        "comment": "It’s expensive but StockX has them all"
      },
      {
        "commenter_username": "reflex2001",
        "comment": "Check out their insta page (bulkup.jo), they shipped it to me in Canada."
      },
      {
        "commenter_username": "Ok_Cabinet_5691",
        "comment": "If you are from uk get it from vinted"
      },
      {
        "commenter_username": "Amazing-Incident2633",
        "comment": "Depending on your size I could sell you one"
      },
      {
        "commenter_username": "Brewerycomedynights",
        "comment": "If you're in Canada, I've got the Carmine Red short sleeve never worn in a Large I'm looking to sell.\n\nNot a scalper, but the shirts unfortunately do not look great with my short torso so looking to offload this one"
      },
      {
        "commenter_username": "Legitimate-Profit-58",
        "comment": "eBay has a lot of sellers reselling this hahah"
      },
      {
        "commenter_username": "thesecretstuff74",
        "comment": "eBay and stockX if your primarily concerned about authenticity, but just to add on, there are some phenomenal reps on CNfans if you want to save a few bucks"
      },
      {
        "commenter_username": "MobileNo4780",
        "comment": "I got it"
      }
    ]
  },
  {
    "title": "Confused about order - codes?",
    "username": "Merry-Vandal",
    "comments": [
      {
        "commenter_username": "Gigi_lovez",
        "comment": "Same thing is happening to me. So annoying"
      }
    ]
  },
  {
    "title": "uggghhhh restockkkk",
    "username": "jonahmustard",
    "comments": [
      {
        "commenter_username": "k-o-v-a-k",
        "comment": "Been waiting months for the vital shirts to restock and nothing. Looks like they make a line, once it’s gone it’s gone and they move on."
      },
      {
        "commenter_username": "Life-Research-2962",
        "comment": "I don’t think they restock everything unfortunately! Your best bet would be to ask for a notification if the item and size is restocked or check reselling/external sites that may have stock"
      }
    ]
  },
  {
    "title": "Anyone know what shirt this is?",
    "username": "Forliww",
    "comments": [
      {
        "commenter_username": "Doinkiee",
        "comment": "Gymshark I think"
      },
      {
        "commenter_username": "clownerij",
        "comment": "vital seamless t-shirt! its womens\n\nhttps://preview.redd.it/xbsb8lrtuwcg1.jpeg?width=1692&amp;format=pjpg&amp;auto=webp&amp;s=d1062864c9a233a7d07a2e52ab07cf71fd49eeec"
      },
      {
        "commenter_username": "SurroundQuirky9525",
        "comment": "https://uk.gymshark.com/products/gymshark-vital-seamless-t-shirt-ss-tops-black-ss25\n\nChanged slightly now but defo same product"
      },
      {
        "commenter_username": "DraftCreepy7989",
        "comment": "It’s a useless shirt, I think u should just give it to me"
      },
      {
        "commenter_username": "SurroundQuirky9525",
        "comment": "Men’s vital seamless"
      }
    ]
  },
  {
    "title": "Onyx pop up in selfridges",
    "username": "Independent-Arm-629",
    "comments": [
      {
        "commenter_username": "hldtightmanlikedarkz",
        "comment": "There was definitely some for sale in the Trafford centre selfridges"
      }
    ]
  },
  {
    "title": "Oversized",
    "username": "Acost_V",
    "comments": [
      {
        "commenter_username": "DryEstablishment2460",
        "comment": "What are the joggers called?"
      },
      {
        "commenter_username": "clownerij",
        "comment": "what size are you wearing in the pic? looks good!"
      },
      {
        "commenter_username": "Acost_V",
        "comment": "S, bro"
      },
      {
        "commenter_username": "Important-Ad3820",
        "comment": "Fire"
      },
      {
        "commenter_username": "[deleted]",
        "comment": "[removed]"
      }
    ]
  },
  {
    "title": "First 3 months. Any advice for me?",
    "username": "Witty-Pie4579",
    "comments": [
      {
        "commenter_username": "Full_Cheek_1922",
        "comment": "Keep up what your doing"
      },
      {
        "commenter_username": "IssmaG",
        "comment": "stay hard!!"
      },
      {
        "commenter_username": "XYMYX",
        "comment": "Ur doing good, can already see a difference keep on the hard work!"
      },
      {
        "commenter_username": "Academic_Desk7829",
        "comment": "Can I ask what your height/starting weight was?? I’m in a similar boat but I just started lol"
      },
      {
        "commenter_username": "bbaacctt",
        "comment": "Juice"
      }
    ]
  },
  {
    "title": "Love my new gymshark pieces 💪",
    "username": "ObjectivePay5165",
    "comments": []
  },
  {
    "title": "Cap apparel",
    "username": "Right-Hedgehog-7722",
    "comments": [
      {
        "commenter_username": "JavyBarrera25",
        "comment": "I have one for sell on my Poshmark. It’s the dad cap with the logo on the front and lettering on the back of it."
      }
    ]
  },
  {
    "title": "Has anyone else randomly received a poster like this",
    "username": "Standard-Contact469",
    "comments": [
      {
        "commenter_username": "sam_aziz",
        "comment": "Not really"
      },
      {
        "commenter_username": "JavyBarrera25",
        "comment": "Bass player and drummer from slipknot"
      }
    ]
  },
  {
    "title": "Women’s oversized tshirt sizing changed :(",
    "username": "Difficult-Error-4139",
    "comments": [
      {
        "commenter_username": "Mundane_Studio_5674",
        "comment": "All their products have changed, haven’t been loving their designs since I  last bought my rest day t shirts"
      },
      {
        "commenter_username": "AMadRam",
        "comment": "Wait you washed it? There's a chance it would have shrunk now given these clothes are notorious to shrinkage after a wash."
      },
      {
        "commenter_username": "SandwichCultural6942",
        "comment": "Absolutely true, that’s why I buy xl, it’s a pain in the ass to guess the sizing, unlike YoungLA that they do show the garment’s measures"
      }
    ]
  },
  {
    "title": "Sweat seamless legging replacement?",
    "username": "TheAnxiousMatchaDog",
    "comments": [
      {
        "commenter_username": "nikkisharif",
        "comment": "My preferred leggings are Everyday Seamless &amp; Vital Seamless. I haven’t had any issues with them being see through."
      }
    ]
  },
  {
    "title": "Geo Shirt Fit",
    "username": "tzalpha1",
    "comments": [
      {
        "commenter_username": "CXyber",
        "comment": "Medium probably, I wear a medium at 170 too"
      }
    ]
  },
  {
    "title": "What is this shirt called??",
    "username": "Its_Luis-",
    "comments": [
      {
        "commenter_username": "Duffle",
        "comment": "I think it’s the element base layer mock neck long sleeve t-shirt in black. They only have white in stock right now but I have a grey one that I bought on the Black Friday sale"
      },
      {
        "commenter_username": "Mindless_Fishing_238",
        "comment": "I have this version in baselayer long sleeve ( without the neck mock)"
      },
      {
        "commenter_username": "Melodic_Carpet6223",
        "comment": "the one on the model is a sleeves tee. the second pic doesn’t exist, but there was a base layer tee and long sleeve early 2024 with the red chest logo"
      },
      {
        "commenter_username": "zfrizzle",
        "comment": "Did a double take on the cropped first image. Thought this needed a nsfw tag for a second lol"
      },
      {
        "commenter_username": "SaltineICracker",
        "comment": "The black chokehold\n\nJk but seriously ive got a 1/4 zip with this similar material and all the way zipped up it's kinda hard to breathe ngl\n\nBe weary"
      },
      {
        "commenter_username": "Imma-be-real-wit-u",
        "comment": "Its looks just like the power cut off sleeves shirt\n\nhttps://preview.redd.it/fhai9qaobhcg1.jpeg?width=1206&amp;format=pjpg&amp;auto=webp&amp;s=8c6bde4eca269ab5452ba9057e92ffb9a37ec2f7\n\nAnd looks like the mannequin has a tighter fit ie. sized down, Hope this helps"
      },
      {
        "commenter_username": "Imma-be-real-wit-u",
        "comment": "Heres the long sleeve too\n\nhttps://preview.redd.it/mt4e146tbhcg1.jpeg?width=1206&amp;format=pjpg&amp;auto=webp&amp;s=969609f5a6f03856eb0a02a4d32ea927a4d646d5"
      },
      {
        "commenter_username": "Realistic_Chef_2321",
        "comment": "The first one looks like it may be the power tank, in black and red. \nSecond one is a compression. But I dont think they sell it anymore they only sell the model as pure black, not black and red."
      },
      {
        "commenter_username": "Apprehensive-Push-52",
        "comment": "is that a mf chris bumstead mannequin"
      },
      {
        "commenter_username": "[deleted]",
        "comment": "[removed]"
      }
    ]
  },
  {
    "title": "OC down 90+ in 11 months",
    "username": "clicker022",
    "comments": [
      {
        "commenter_username": "iamdavid18",
        "comment": "Keep the hard work!"
      },
      {
        "commenter_username": "WiJoWi",
        "comment": "Hell yeah dude"
      },
      {
        "commenter_username": "mthwkim",
        "comment": "Keep it up man!!"
      },
      {
        "commenter_username": "cammohhh",
        "comment": "Good work brother"
      },
      {
        "commenter_username": "Ok_Championship_4368",
        "comment": "How were you able to accomplish that? If you dont mind sharing your journey"
      },
      {
        "commenter_username": "Hellgirl-6669",
        "comment": "I lost 110 total since 2020. 40 of that in 12 months. But 90 is super impressive in a year!!!!"
      }
    ]
  },
  {
    "title": "Onyyyyx🫶🏻",
    "username": "dautx1",
    "comments": [
      {
        "commenter_username": "Cold-Ant-2755",
        "comment": "What size is that and what are your height and weight measurements if you don’t mind me asking"
      },
      {
        "commenter_username": "Omniousdomain",
        "comment": "Ok, ok....you been getting your protein consistently I see. Nice work champ!"
      }
    ]
  },
  {
    "title": "How many of these were made?",
    "username": "Imaginary_Bird2379",
    "comments": [
      {
        "commenter_username": "raccoonwhispers",
        "comment": "Ehhhhhh idk bro nobody really hunts this stuff as it's niche. But I've seen quite a few on depop in the last while. Probably 10+ I've seen"
      }
    ]
  },
  {
    "title": "Question about Gymshark leggings quality + recommendations",
    "username": "DirectionOk7752",
    "comments": [
      {
        "commenter_username": "dogwiggle",
        "comment": "i decided to try out gymshark this past black friday and have been really loving their [adapt fleck line](https://www.gymshark.com/products/gymshark-adapt-seamless-fleck-shorts-black-smokey-grey-aw23). i’ve only tried the shorts so far, but i ended up getting 6 pairs because i love them that much. they’re squat proof, no butt scrunch (but still flattering), and feel really high quality."
      },
      {
        "commenter_username": "zomeega",
        "comment": "Yeah the everyday seamless line is notoriously the most see through they have. The vital soft is a bit more see through than the OG vital range as well. Lighter colours might be worse but my black vital shorts aren’t see through.\nOpt for thicker lines like adapt- so fleck and animal. Lift seamless is decent but not entirely opaque because of the thinner glute material"
      }
    ]
  },
  {
    "title": "Just got this and a faulty machine tore it; any way to salvage it as I love the shirt?",
    "username": "Normal-Cow-5450",
    "comments": [
      {
        "commenter_username": "Overall_Director1131",
        "comment": "Try to return it if you didn’t get it long ago"
      },
      {
        "commenter_username": "SexyProcrastinator",
        "comment": "What do you mean by a faulty machine tore it? \n\nTake it to a tailor to fix it."
      },
      {
        "commenter_username": "raccoonwhispers",
        "comment": "This is a compression. So yea, it's a wrap."
      },
      {
        "commenter_username": "tzalpha1",
        "comment": "Have it sown closed with a contrasting color to make it a customized feature?"
      },
      {
        "commenter_username": "shazeb1",
        "comment": "blame it on gymshark and try to get a new one for free"
      }
    ]
  },
  {
    "title": "Thinking About the ADAPT ANIMAL SEAMLESS LEGGINGS. Is it Squat Proof? Do They Rip Easily?",
    "username": "New-Bodybuilder-7264",
    "comments": [
      {
        "commenter_username": "Rosequartzsurfboardt",
        "comment": "I like them as long as they dont have the scrunch butt.\n\nIve had a few with the seam and I dont think I'm exactly carrying a whole bakery back there but the scrunch unscrunched on day one. I love everything else out of the line cept the butt scrunch. Its compressive, squat proof, stays put pretty well."
      },
      {
        "commenter_username": "Beautiful-Star-2706",
        "comment": "If you are open to wearing shorts, then I would definitely recommend the shorts over the leggings! They are my favorite shorts to wear during the summer and I've never had any issues with the seam ripping."
      }
    ]
  },
  {
    "title": "GS drops price",
    "username": "Independent-Turn-169",
    "comments": [
      {
        "commenter_username": "banxy85",
        "comment": "Thank you GS for realizing no one paying that shit 😂"
      },
      {
        "commenter_username": "stock-slay",
        "comment": "Looks like Temu Ed Hardy"
      },
      {
        "commenter_username": "TacoCatSpins",
        "comment": "Who is paying $54 for this shit?"
      },
      {
        "commenter_username": "torontowest91",
        "comment": "They just keep raising prices. Trying to charge lulu or alo yoga next."
      },
      {
        "commenter_username": "gabhersch",
        "comment": "🗑️ drop"
      },
      {
        "commenter_username": "Tricky_Hall_5383",
        "comment": "Man I actually lowkey like this. Am I just a cornball? Hahahahahahahaha"
      },
      {
        "commenter_username": "mynewnikes",
        "comment": "I wouldn’t buy if it was 20 bucks, just a bad design IMO"
      },
      {
        "commenter_username": "Juraizdzungle",
        "comment": "Trash"
      },
      {
        "commenter_username": "Realistic_Chef_2321",
        "comment": "I would consider buying it, but at a fraction of this price"
      },
      {
        "commenter_username": "chu-yew-up",
        "comment": "Canadians paying almost $80 for it 😂"
      }
    ]
  },
  {
    "title": "Gymshark mock neck",
    "username": "Leading_Medicine9412",
    "comments": [
      {
        "commenter_username": "SexyProcrastinator",
        "comment": "4505 ASOS has better mock neck base layer tops and it’s cheaper"
      }
    ]
  },
  {
    "title": "Apex collection more colours",
    "username": "Affectionate-Gap-353",
    "comments": [
      {
        "commenter_username": "Rosequartzsurfboardt",
        "comment": "I can already see the puncture pull mark. Ive had two pairs of these and I wanna love em but they are made of the thinnest material. If I put it on and my dull nail grabs it in the right way it immediately rips."
      },
      {
        "commenter_username": "Z3n1k3",
        "comment": "Got my gf the blue ones and it's a solid design 👌"
      },
      {
        "commenter_username": "Curious_Conscious8",
        "comment": "Is that a rip in the fabric right in the middle of the glute…."
      },
      {
        "commenter_username": "slom26",
        "comment": "See through and a rip. They junk"
      },
      {
        "commenter_username": "ben301",
        "comment": "Good one"
      },
      {
        "commenter_username": "alwayshangry5748",
        "comment": "dat booty tho 👀"
      },
      {
        "commenter_username": "prettysavvy_",
        "comment": "Sidebar: your muscle build is nice"
      },
      {
        "commenter_username": "Zestyclose-Soft-3024",
        "comment": "cute"
      },
      {
        "commenter_username": "SubstantialStrike352",
        "comment": "Material and seams so weak"
      },
      {
        "commenter_username": "AdorablePay8740",
        "comment": "lol you followed me on ig out of nowhere then proceeded to unfollow a day after, you just tryna gain followers I get it but guess what I don’t follow people who don’t follow back lmao"
      },
      {
        "commenter_username": "No-Nobody3393",
        "comment": "Shorty you got hella confidence and tbh, the apex looks great. Keep grinding in the gym you are looking strong and confident!!!!"
      }
    ]
  },
  {
    "title": "Where is this Gymshark storm set available on the website?",
    "username": "PopExcellent1628",
    "comments": [
      {
        "commenter_username": "NostrumBat",
        "comment": "It was sold out month ago, idk if they gonna do a restock"
      }
    ]
  },
  {
    "title": "New drop is awesome but what are with these prices",
    "username": "branddnew",
    "comments": [
      {
        "commenter_username": "Inevitable-Lie9981",
        "comment": "Nah gymwear is just getting ridiculously overpriced."
      },
      {
        "commenter_username": "JavyBarrera25",
        "comment": "Trying to be like Darc… smh. Gymshark used to have good prices"
      },
      {
        "commenter_username": "802ScubaF1sh",
        "comment": "The art is cool, yeah, but who actually wears this stuff? I dont want to look like the tren twins. Gymshark is continuing to move away from their core style that made them 'cool' to begin with."
      },
      {
        "commenter_username": "xHouseOfPleasure",
        "comment": "Ngl that shit is ugly asf"
      },
      {
        "commenter_username": "Elegant-Picture1003",
        "comment": "Expensive! I always wait for the season sales now."
      },
      {
        "commenter_username": "Vivid_Marketing_3779",
        "comment": "I could be wrong but i think it's because is a special collaboration with the artist that painted the designs"
      },
      {
        "commenter_username": "TKDNinjaJenn2",
        "comment": "I wait to buy 90% of my GymShark purchases when they go on sale. If they go out of stock before then whelp 🤷🏻‍♀️"
      },
      {
        "commenter_username": "branddnew",
        "comment": "Edit: the more I think of it there’s nothing really awesome about this. It’s sort of cringy and they’re trying to be something they aren’t. Gymshark has really strayed away from what made them great to begin with."
      },
      {
        "commenter_username": "Amazing-Incident2633",
        "comment": "Gymshark have seriously increased their prices idk why they used he okay prices now they’re to expensive"
      },
      {
        "commenter_username": "No-Battle-9753",
        "comment": "They’ll do anything but restock some of their best merchandise 🥀"
      },
      {
        "commenter_username": "SladeWilsonXL9",
        "comment": "Youngla trash, I miss when Gymshark would just have their sharkhead logo and that would be it."
      },
      {
        "commenter_username": "ben301",
        "comment": "Look like YungLA"
      },
      {
        "commenter_username": "mikebigcox",
        "comment": "66 dollars for a t shirt is fkn nuts"
      },
      {
        "commenter_username": "weadus",
        "comment": "There’s nothing from gymshark that’s worth $80 (I’ve been shopping here for 8 years, max id ever pay is $40. The quality is not what it used to be)"
      },
      {
        "commenter_username": "lol25potatofarm",
        "comment": "Its printed shit for fucks sake. Prices make it seem its hand made lol. They probably come off in the wash too."
      },
      {
        "commenter_username": "BlazinWolfz",
        "comment": "We looking at the same clothes? If they didn’t say it was from an artist I would think you typed warrior Toy Story into chat gpt and slapped it on some clothing"
      },
      {
        "commenter_username": "Fluddle",
        "comment": "Good things I only buy rep darc sport from China , I ain’t spending over $50 just for a t shirt. Gym clothes shouldn’t not be this expensive"
      },
      {
        "commenter_username": "WrapAwkward8306",
        "comment": "What happened to just throwing on raggedy clothes and just go lift? Now people treat the gym like a fashion show..It’s GymShark, YoungLA, and DarcSport everywhere. Dropping $55-70 for a piece of clothing just to sweat in is just crazy."
      },
      {
        "commenter_username": "Rex40-",
        "comment": "Cool but expensive..."
      }
    ]
  },
  {
    "title": "Thoughts on new Power X Frazetta Graphic collection",
    "username": "Harish224",
    "comments": [
      {
        "commenter_username": "banxy85",
        "comment": "Honestly pretty lame and very overpriced"
      },
      {
        "commenter_username": "branddnew",
        "comment": "I think they’re cool but way overpriced. Reminds me a lot of the youngla collabs."
      },
      {
        "commenter_username": "ben301",
        "comment": "YungLA"
      },
      {
        "commenter_username": "Inevitable-Lie9981",
        "comment": "At this point, I bet you can find a similar design that costs cheaper that isn't from a gymwear brand."
      },
      {
        "commenter_username": "CryoMazeRunner",
        "comment": "Looks trashy"
      },
      {
        "commenter_username": "Angry_Elote87",
        "comment": "DARCSHARK"
      },
      {
        "commenter_username": "juriarte911",
        "comment": "Cringey ass gym clothing 😂. Golden Era would clown this shit 💩"
      },
      {
        "commenter_username": "Shanavret",
        "comment": "I think it’s a cool idea but Gymshark really bums me out with their marketing when they only promote stuff like this to dudes."
      },
      {
        "commenter_username": "Andrew_R3D",
        "comment": "Corny"
      },
      {
        "commenter_username": "JakubJamesBoote",
        "comment": "Shite"
      },
      {
        "commenter_username": "ItsMehRuby",
        "comment": "Crappy design, and overpriced!"
      },
      {
        "commenter_username": "CimmerianBooty",
        "comment": "I am a huge Frazetta fan, but there are other pieces I wish they had picked."
      },
      {
        "commenter_username": "whotheowl90",
        "comment": "no way anyone thinks this doesn’t look like shein ed hardy right?"
      },
      {
        "commenter_username": "Swayzer709",
        "comment": "I like gym clothes. Not streetwear clothes"
      },
      {
        "commenter_username": "Beginning-Visit2665",
        "comment": "💩💩💩"
      },
      {
        "commenter_username": "bibila",
        "comment": "Youngshark"
      },
      {
        "commenter_username": "TheBeast1424",
        "comment": "If i could appreciate the context and art behind it this would be so sick, first set does still look pretty cool (not both together tho)"
      },
      {
        "commenter_username": "Harish224",
        "comment": "If you guys were following Youngla, they are releasing anime inspired clothing which looks lame too tbh. I guess this year started with some weird stuff from every brand out there."
      },
      {
        "commenter_username": "SandwichCultural6942",
        "comment": "Ugly and overpriced"
      },
      {
        "commenter_username": "AliensAndPyramids",
        "comment": "I wish they had some frazetta clothes for girls. I’m a fan of his art. Might get the men’s"
      },
      {
        "commenter_username": "Single-Lawfulness-49",
        "comment": "they’re becoming youngla 😭"
      },
      {
        "commenter_username": "chu-yew-up",
        "comment": "Looks like what metal dudes would paint on their vans in the 80s lol"
      }
    ]
  },
  {
    "title": "Will we see more of the Whitney leggings?",
    "username": "Fancy_Usual6904",
    "comments": [
      {
        "commenter_username": "SurroundQuirky9525",
        "comment": "Absolutely yes there will be more"
      }
    ]
  },
  {
    "title": "Can someone tell me what Gymshark shirt this is?",
    "username": "Traditional_Farm2975",
    "comments": [
      {
        "commenter_username": "Z3n1k3",
        "comment": "Almost looks like the vital seamless now but maybe an older version."
      },
      {
        "commenter_username": "alexanderzeus1",
        "comment": "It’s the Vital line, I had this one a few years ago but can’t remember exact name."
      },
      {
        "commenter_username": "LightBlazeMC",
        "comment": "Vital"
      },
      {
        "commenter_username": "Glittering-Juice-483",
        "comment": "It’s the vital seamless, i have the exact same shirt. Copped from their website September 26th, 2024."
      }
    ]
  }
]