[
  {
    "title": "[Announcement] AUTHENTICATION MEGATHREAD 🚩",
    "username": "arozze",
    "comments": [
      {
        "commenter_username": "Conley521",
        "comment": "Real or Fake?"
      },
      {
        "commenter_username": "Conley521",
        "comment": "Back Side"
      },
      {
        "commenter_username": "Conley521",
        "comment": "Be a Visionary Text"
      },
      {
        "commenter_username": "Harish224",
        "comment": "Curious question, Do you have a different smell from the fabric which you never experienced before from any other Gymshark clothing?"
      },
      {
        "commenter_username": "Conley521",
        "comment": "Nah smells similar to any Gymshark product but I don’t buy Gymshark that often so hard to say"
      }
    ]
  },
  {
    "title": "BUY / SELL / TRADE BUY | TRADE | SELL Megathread",
    "username": "V0dka-Coke",
    "comments": [
      {
        "commenter_username": "lgvrn_03",
        "comment": "Buying: Anything except the Black with blue logo in Southeast Asia"
      },
      {
        "commenter_username": "papa_papa6-9",
        "comment": "Looking to trade longsleeve and short sleeve blue size small for medium any color"
      },
      {
        "commenter_username": "sensative_red",
        "comment": "Will have a medium tshirt in black with blue logo in a few days in medium"
      },
      {
        "commenter_username": "raccoonwhispers",
        "comment": "Selling 4 different Onyx v5. I hate how they fit me. The new blue colorway short sleeve size S, green colorway short sleeve size S, grey colorway long sleeve size S, OG blue and black short sleeve size XS. Not going to sell them at insane scalping prices. All are 100% authentic.\nEDIT: willing to trade for YLA stuff like Superman. Just DM me. If trading, I will be picky."
      },
      {
        "commenter_username": "asdvfisosbdjsk",
        "comment": "[ image ]\nWant to buy these retro track pants in size L/XL or even XXL."
      }
    ]
  },
  {
    "title": "New GS fit. Love this color",
    "username": "ObjectivePay5165",
    "comments": [
      {
        "commenter_username": "LegDrive91",
        "comment": "Looks great on you"
      }
    ]
  }
  ,
  {
    "title": "Dear Gymshark: Please stop putting this butthole scrunchie on your leggings. I don’t want a second butthole and this looks freakin terrible. I will be returning these thank you 😂 These are the new animal print collection.",
    "username": "vera_foxx",
    "comments": [
      {
        "commenter_username": "Spicy_salsa3",
        "comment": "I bought the adapt camo with the same butt scrunch and the first time i put them on the scrunch ripped and now i have a big hole on my bum.\nGymshark did refund me though thankfully"
      },
      {
        "commenter_username": "Kooky-Shock",
        "comment": "omg.....\non second thought, maybe it looks better if you drag the seam between buttcheeks like all the gymshark girls does. but then again, there&apos;s no seam except for the scrunch? doesn&apos;t seamless pants give you a unibutt?"
      }
    ]
  },
  {
    "title": "Apex collection more colours",
    "username": "Affectionate-Gap-353",
    "comments": [
      {
        "commenter_username": "Rosequartzsurfboardt",
        "comment": "I can already see the puncture pull mark.Ive had two pairs of these and I wanna love em but they are made of the thinnest material. If I put it on and my dull nail grabs it in the right way it immediately rips."
      },
      {
        "commenter_username": "Rosequartzsurfboardt",
        "comment": "Flattering, sure, functional? Debatable. For the price im going to need a little bit more than that. This is one of their more expensive lines just give me viable fabric I can squat in without my entire ass being out"
      }
    ]
  }

  
]